In [ ]:
#Install Datasets
!pip install datasets
!pip install matplotlib
#importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#loading data 
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [6]:
df.iloc[0:10, 5] #Getting the details of the dataset from 0 to 10th row of the 5th column, i.e, job_work_from column Details

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8    False
9     True
Name: job_work_from_home, dtype: bool

In [14]:
df.loc[:, 'salary_rate':'salary_hour_avg'].dropna(subset='salary_rate') # Dropping NAN values of the coulmns from  'salary_rate' to 'salary_hour_avg' by using loc method

       salary_rate  salary_year_avg  salary_hour_avg
28            year         109500.0              NaN
43            hour              NaN             97.5
51            hour              NaN             72.5
77            year         140000.0              NaN
92            year         120000.0              NaN
...            ...              ...              ...
785624        year         139216.0              NaN
785641        year         150000.0              NaN
785648        year         221875.0              NaN
785682        year         157500.0              NaN
785692        year         157500.0              NaN

[33067 rows x 3 columns]